app/views/listings/_listing.html.erb

  <span class="timestamp">
    Posted <%= time_ago_in_words(listing.created_at) %> ago by <%= link_to listing.user.fName, listing.user %>
---
INSERT INTO "listings" ("content", "created_at", "price", "title", "type_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["content", "test"], ["created_at", "2014-11-04 19:32:43.439336"], ["price", 1.0], ["title", "Prof. Slughorn"], ["type_id", 3], ["updated_at", "2014-11-04 19:32:43.439336"], ["user_id", 2]]