app/views/types/show.html.erb

SELECT  1 AS one FROM "listings"  WHERE "listings"."type_id" = $1 LIMIT 1  [["type_id", 3]]
---
<div>
  <% if @type.listings.any? %>