app/views/users/show.html.erb

	<div>
	  <% if @user.listings.any? %>
---
SELECT  1 AS one FROM "listings"  WHERE "listings"."user_id" = $1 LIMIT 1  [["user_id", 9]]