app/views/shared/_listing_form.html.erb

SELECT "types".* FROM "types"
---
		<span class="field-text"> Pick a category </span>
		<%= f.collection_select :type_id, Type.all, :id, :category %>