app/views/shared/_user_info.html.erb


<!-- <span><%= pluralize(current_user.listings.count, "posts") %></span> -->
---
SELECT COUNT(*) FROM "listings"  WHERE "listings"."user_id" = $1  [["user_id", 9]]