app/controllers/listings_controller.rb

SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
---
  def show
    @listing = Listing.find(params[:id])

INSERT INTO "listings" ("content", "created_at", "price", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "This is a book. A nice book, too. "], ["created_at", "2014-10-28 00:59:08.168887"], ["price", 50.0], ["title", "A book"], ["updated_at", "2014-10-28 00:59:08.168887"], ["user_id", 9]]
---
   def create
    @listing = current_user.listings.build(listing_params)
    if @listing.save

SELECT  "listings".* FROM "listings"  WHERE "listings"."user_id" = $1 AND "listings"."id" = 2  ORDER BY created_at DESC LIMIT 1  [["user_id", 2]]
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 2]]
---
  def destroy
    @user = @listing.user
    @listings = @user.listings.all
    @solds = @user.solds.all
    @listing.destroy

SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 2]]
---
  def edit
    @listing = Listing.find(params[:id])

SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 2]]
UPDATE "listings" SET "title" = $1, "updated_at" = $2 WHERE "listings"."id" = 69  [["title", "tests"], ["updated_at", "2014-11-04 19:57:54.873499"]]
---
  def update
    @listing = Listing.find(params[:id])
    if @listing.update_attributes(listing_params)