app/controllers/static_pages_controller.rb

SELECT COUNT(*) FROM "listings"  WHERE "listings"."user_id" = $1  [["user_id", 9]]
---
  def home
    if logged_in?
      @listing = current_user.listings.build
      @feed_items = current_user.feed.paginate(page: params[:page])