app/controllers/static_pages_controller.rb

SELECT  "listings".* FROM "listings"  WHERE (user_id = 9)  ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "listings"  WHERE (user_id = 9)
SELECT  "types".* FROM "types"  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "types"
---
  def home
    if logged_in?
      @listing = current_user.listings.build
      @feed_items = Listing.all.paginate(page: params[:page])
    end

    @types = Type.paginate(page: params[:page])