app/controllers/types_controller.rb

  def show
    @type = Type.find(params[:id])
    @listings = @type.listings.paginate(page: params[:page])
---
SELECT  "types".* FROM "types"  WHERE "types"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "listings".* FROM "listings"  WHERE "listings"."type_id" = $1  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["type_id", 1]]
SELECT COUNT(*) FROM "listings"  WHERE "listings"."type_id" = $1  [["type_id", 1]]