app/controllers/users_controller.rb

  def index
<<<<<<< HEAD
    @users = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  LIMIT 30 OFFSET 0

  def show
    @user = User.find(params[:id])
<<<<<<< HEAD
    @listings = @user.listings.paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "listings".* FROM "listings"  WHERE "listings"."user_id" = $1  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 9]]
SELECT COUNT(*) FROM "listings"  WHERE "listings"."user_id" = $1  [["user_id", 9]]

  def create
      @user = User.new(user_params)
      @listings =  @user.listings.all
      # @listings =  @user.listings.paginate(page: params[:page])
      if @user.save
---
INSERT INTO "users" ("classYr", "created_at", "email", "fName", "lName", "password_digest", "sID", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @user = User.find(params[:id])
    @listings =  @user.listings.all
    # @listings =  @user.listings.paginate(page: params[:page])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "sID" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$RTfgWqOMx0j8ss1CvV7KkOqyq1fvcL.yItFpMx9B8qOwJQsJ.WFpm"], ["sID", 27757988], ["updated_at", "2014-10-09 00:11:50.521291"]]

  def destroy
    @user = User.find(params[:id])
    log_out
    @user.destroy
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]